experiments/2026-05-26_aqraft_workloads/logs/workloadb/ycsb_load_raw.txt
/usr/bin/java  -classpath /users/entall/ycsb_client/conf:/users/entall/ycsb_client/lib/HdrHistogram-2.1.12.jar:/users/entall/ycsb_client/lib/core-0.18.0-SNAPSHOT.jar:/users/entall/ycsb_client/lib/htrace-core4-4.1.0-incubating.jar:/users/entall/ycsb_client/lib/jackson-core-asl-1.9.4.jar:/users/entall/ycsb_client/lib/jackson-mapper-asl-1.9.4.jar:/users/entall/ycsb_client/redis-binding/lib/commons-pool2-2.4.2.jar:/users/entall/ycsb_client/redis-binding/lib/jedis-2.9.0.jar:/users/entall/ycsb_client/redis-binding/lib/redis-binding-0.18.0-SNAPSHOT.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -p redis.host=redis0 -p redis.port=8000 -p redis.cluster=true -P /users/entall/rd/workloads/workloadb -p status.interval=10 -s -threads 50
Command line: -load -db site.ycsb.db.RedisClient -p redis.host=redis0 -p redis.port=8000 -p redis.cluster=true -P /users/entall/rd/workloads/workloadb -p status.interval=10 -s -threads 50
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2026-05-26 14:00:34:421 0 sec: 0 operations; est completion in 0 second 
WARN: CLUSTER SLOTSTATE failed (treating all slots as STABLE): ERR Unknown subcommand.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
WARN: CLUSTER SLOTSTATE failed (treating all slots as STABLE): ERR Unknown subcommand.
WARN: CLUSTER SLOTSTATE failed (treating all slots as STABLE): ERR Unknown subcommand.
WARN: CLUSTER SLOTSTATE failed (treating all slots as STABLE): ERR Unknown subcommand.
[...]
2026-05-26 14:00:44:389 10 sec: 39797 operations; 3979.7 current ops/sec; est completion in 1 minute [INSERT: Count=39797, Max=41375, Min=1374, Avg=4798.68, 50=4675, 90=5987, 99=7455, 99.9=29215, 99.99=33311] 
2026-05-26 14:00:54:389 20 sec: 144794 operations; 10499.7 current ops/sec; est completion in 50 seconds [INSERT: Count=105021, Max=9495, Min=1272, Avg=4750.19, 50=4711, 90=5999, 99=6983, 99.9=7927, 99.99=9255] 
2026-05-26 14:01:04:389 30 sec: 238430 operations; 9363.6 current ops/sec; est completion in 33 seconds [INSERT: Count=93632, Max=181503, Min=1534, Avg=5331.26, 50=5183, 90=6507, 99=7703, 99.9=56767, 99.99=178047] 
2026-05-26 14:01:14:389 40 sec: 336026 operations; 9759.6 current ops/sec; est completion in 20 seconds [INSERT: Count=97576, Max=60383, Min=1712, Avg=5114.5, 50=5079, 90=6347, 99=7307, 99.9=9207, 99.99=58239] 
2026-05-26 14:01:24:389 50 sec: 429002 operations; 9297.6 current ops/sec; est completion in 9 second [INSERT: Count=92978, Max=213503, Min=825, Avg=5371.05, 50=5127, 90=6511, 99=8171, 99.9=70975, 99.99=209919] 
2026-05-26 14:01:32:209 57 sec: 500000 operations; 9079.03 current ops/sec; [CLEANUP: Count=50, Max=5447, Min=1088, Avg=1896.34, 50=1703, 90=2573, 99=5447, 99.9=5447, 99.99=5447] [INSERT: Count=70996, Max=185983, Min=948, Avg=5380.07, 50=5199, 90=6591, 99=7915, 99.9=59071, 99.99=185855] 
[OVERALL], RunTime(ms), 57820
[OVERALL], Throughput(ops/sec), 8647.526807333103
[TOTAL_GCS_G1_Young_Generation], Count, 14
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 130
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2248356969906607
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 14
[TOTAL_GC_TIME], Time(ms), 130
[TOTAL_GC_TIME_%], Time(%), 0.2248356969906607
[CLEANUP], Operations, 50
[CLEANUP], AverageLatency(us), 1896.34
[CLEANUP], MinLatency(us), 1088
[CLEANUP], MaxLatency(us), 5447
[CLEANUP], 50thPercentileLatency(us), 1703
[CLEANUP], 95thPercentileLatency(us), 3601
[CLEANUP], 99thPercentileLatency(us), 5447
[INSERT], Operations, 500000
[INSERT], AverageLatency(us), 5138.84948
[INSERT], MinLatency(us), 825
[INSERT], MaxLatency(us), 213503
[INSERT], 50thPercentileLatency(us), 5007
[INSERT], 95thPercentileLatency(us), 6747
[INSERT], 99thPercentileLatency(us), 7619
[INSERT], Return=OK, 500000